_Rarzrabotki/Kazna/Documents/СчетНаОплатуПоставщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СчетНаОплатуПоставщика</Name>
			<BasedOn>
				<xr:Item>Document.СчетНаОплатуПоставщика</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СчетаНал</xr:Item>
				<xr:Item>AccumulationRegister.ЛимитыПроектов</xr:Item>
				<xr:Item>AccumulationRegister.БДДС</xr:Item>
				<xr:Item>AccumulationRegister.ЛимитыНаМесяц</xr:Item>
				<xr:Item>AccumulationRegister.СчетаПоставщиков</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКонтрагента</Name>
					<Comment>(Общ) Банковский счет контрагента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПриоритетыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>350</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Виза_Причина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Виза_ТекущаяРоль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиВизирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Виза_ТекущиеВизирующие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Виза_Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Виза_ТекущиеВизирующие1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Виза_Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Визы_Состояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Секция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Секции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Этаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗатрат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийСчетНаОплатуПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКоммисии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриоритетнаяСхемаВизирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СхемыВизирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСпецификации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСпецификации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_ФинАгент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._Финагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_ПроцентФинАгента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_ДатаВозвратаФинАгента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_КассаПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Визы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиВизирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Виза_Состояние</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Визы_Состояния</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Авто</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТекущиеВизирующие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПредварительныеВизы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Утверждено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаУтверждения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Роли</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СчетаОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Kazna/InformationRegisters/ОтметкиРегистрацииНН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ОтметкиРегистрацииНН</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/Enums/ВидыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыДенежныхСредств</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Kazna/Documents/СчетНаОплатуПоставщика/Forms/ФормаСписка_Визирование/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Виза_Список, "Подразделение", Виза_Подразделение, ВидСравненияКомпоновкиДанных.ВИерархии,, ЗначениеЗаполнено(Виза_Подразделение));
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Виза_Список, "Организация", Виза_Организация, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено( Виза_Организация ));
КонецПроцедуры

&НаКлиенте
Процедура СтостяниеПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Виза_Список, "Виза_Состояние", Виза_Состояние, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено( Виза_Состояние ));
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	УстановитьПараметрыСписка();
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыСписка()
	Виза_Список.Параметры.УстановитьЗначениеПараметра("Прользователь", Виза_Пользователь);
КонецПроцедуры

&НаСервере
Процедура Виза_УтвержденНаСервере(пСсылка, пДопы  )
	
	Если НЕ ЗначениеЗаполнено( пСсылка ) Тогда 
		Возврат;
	КонецЕсли;
	
	Если НЕ пДопы.Свойство("ТекущийПользователь") Тогда 
		пДопы.Вставить("ТекущийПользователь", Пользователи.ТекущийПользователь() );
	КонецЕсли;
	
	Если НЕ пДопы.Свойство("РольДоступна_ПолныеПрава") Тогда 
		пДопы.Вставить("РольДоступна_ПолныеПрава", РольДоступна("ПолныеПрава") );
	КонецЕсли;
	
	лРезультат = Неопределено;
	Документы.СчетНаОплатуПоставщика.Виза_ДокументДоступен_НовыеСостояния(пСсылка, лРезультат, пДопы);
	
	Если НЕ лРезультат.Состояния.НайтиПоЗначению( Перечисления.Визы_Состояния.Утвержден ) = Неопределено Тогда 
		лДок  = пСсылка.ПолучитьОбъект();
		лДок.Виза_УстановитьСостояние(Перечисления.Визы_Состояния.Утвержден, пДопы); 
	Иначе 
		Сообщить( Строка(пСсылка) + " нельзя установить состояние ""Утвержден!""" );
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Виза_ОтложеноУтвержденНаСервере(пСсылка, пДопы  )
	
	Если НЕ ЗначениеЗаполнено( пСсылка ) Тогда 
		Возврат;
	КонецЕсли;
	
	Если НЕ пДопы.Свойство("ТекущийПользователь") Тогда 
		пДопы.Вставить("ТекущийПользователь", Пользователи.ТекущийПользователь() );
	КонецЕсли;
	
	Если НЕ пДопы.Свойство("РольДоступна_ПолныеПрава") Тогда 
		пДопы.Вставить("РольДоступна_ПолныеПрава", РольДоступна("ПолныеПрава") );
	КонецЕсли;
	
	лРезультат = Неопределено;
	Документы.СчетНаОплатуПоставщика.Виза_ДокументДоступен_НовыеСостояния(пСсылка, лРезультат, пДопы);
	
	Если НЕ лРезультат.Состояния.НайтиПоЗначению( Перечисления.Визы_Состояния.ПустаяСсылка() ) = Неопределено Тогда 
		лДок  = пСсылка.ПолучитьОбъект();
		лДок.Виза_УстановитьСостояние(Перечисления.Визы_Состояния.ПустаяСсылка(), пДопы); 
	Иначе 
		Сообщить( Строка(пСсылка) + " нельзя установить состояние ""ОТЛОЖЕНО Утвержден!""" );
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Виза_УтвержденПродолжение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса<>КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;	
	
	лДопы = Новый Структура();
	
	Для Каждого лСтрока Из Элементы.Виза_Список.ВыделенныеСтроки Цикл
		Виза_УтвержденНаСервере( лСтрока,  лДопы);
	КонецЦикла;
	
	Элементы.Виза_Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура Виза_ОтложеноУтвержденПродолжение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса<>КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;	
	
	лДопы = Новый Структура();
	
	Для Каждого лСтрока Из Элементы.Виза_Список.ВыделенныеСтроки Цикл
		Виза_ОтложеноУтвержденНаСервере( лСтрока,  лДопы);
	КонецЦикла;
	
	Элементы.Виза_Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура Виза_Утвержден(Команда)
	
	КоличествоЭлементов = Элементы.Виза_Список.ВыделенныеСтроки.Количество();
	Если КоличествоЭлементов>0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("Виза_УтвержденПродолжение", ЭтотОбъект),
		"Вы действительно хотите утвердить " + КоличествоЭлементов + " заявок?",
		РежимДиалогаВопрос.ДаНет); 
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Виза_Отложено_Утвержден(Команда)
	
	КоличествоЭлементов = Элементы.Виза_Список.ВыделенныеСтроки.Количество();
	Если КоличествоЭлементов>0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("Виза_ОтложеноУтвержденПродолжение", ЭтотОбъект),
		"Вы действительно хотите ОТЛОЖЕНО утвердить " + КоличествоЭлементов + " заявок?",
		РежимДиалогаВопрос.ДаНет); 
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Подразделение2ПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаявкиДС_Список, "Контрагент", Контрагент, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Контрагент));
КонецПроцедуры

&НаКлиенте
Процедура Организация2ПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаявкиДС_Список, "Подразделение", Заявка_Подразделение, ВидСравненияКомпоновкиДанных.ВИерархии,, ЗначениеЗаполнено(Заявка_Подразделение));
КонецПроцедуры

&НаКлиенте
Процедура Виза_ОтклоненоПродолжение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса<>КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	лПараметры = Новый Структура("ВыделенныеСтроки", Элементы.Виза_Список.ВыделенныеСтроки );
	лОповещение= Новый ОписаниеОповещения("Виза_УстановитьСостояние_Описание_Клиент",ЭтотОбъект,лПараметры);
	ПоказатьВводСтроки(лОповещение, , "Укажите причину отказа", 0, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Виза_Отклонено(Команда)
	
	КоличествоЭлементов = Элементы.Виза_Список.ВыделенныеСтроки.Количество();
	Если КоличествоЭлементов>0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("Виза_ОтклоненоПродолжение", ЭтотОбъект),
		"Вы действительно хотите отклонить " + КоличествоЭлементов + " заявок?",
		РежимДиалогаВопрос.ДаНет);
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура Виза_УстановитьСостояние_Описание_Клиент( пСтрока, пПараметры ) Экспорт 
	
	Виза_УстановитьСостояние_Описание_Сервер( пСтрока, пПараметры );
	Элементы.Виза_Список.Обновить();
	
КонецПроцедуры

Процедура Виза_УстановитьСостояние_Описание_Сервер( пСтрока, пПараметры ) Экспорт 
	
	Если НЕ пСтрока = Неопределено Тогда 
		
		лДопы = Новый Структура();
		лДопы.Вставить("Виза_Причина",			пСтрока);
		
		Для Каждого лСтрока Из пПараметры.ВыделенныеСтроки Цикл
			лРезультат = Неопределено;
			Документы.СчетНаОплатуПоставщика.Виза_ДокументДоступен_НовыеСостояния(лСтрока.Ссылка, лРезультат);
			
			Если НЕ лРезультат.Состояния.НайтиПоЗначению( Перечисления.Визы_Состояния.Отклонено ) = Неопределено Тогда 
				лДок  = лСтрока.ПолучитьОбъект();
				лДок.Виза_УстановитьСостояние(Перечисления.Визы_Состояния.Отклонено, лДопы); 
			Иначе 
				Сообщить( Строка(лСтрока.Ссылка) + " нельзя установить состояние ""Отклонено!""" );
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НеПоказыватьОплаченныеЗначениеИзХранилища = ХранилищеОбщихНастроек.Загрузить("ФормаСпискаВизирования","НеПоказыватьОплаченные",,);
	НеПоказыватьОплаченные	= ?(НеПоказыватьОплаченныеЗначениеИзХранилища = Неопределено, Ложь, НеПоказыватьОплаченныеЗначениеИзХранилища);
	
	УстановитьПараметрыСписка();
	УстановитьПараметрыСписка1();
	
	Элементы.СписокКонтекстноеМенюПоказыватьПомеченныеНаУдаление.Пометка = ПоказыватьПомеченныеНаУдаление;
	ВсеСчетаБезналаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьСчетаПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаявкиДС_Список, "ТребуетЗаявкиНаРсходДС", 			ВыводитьСчета = 1, ВидСравненияКомпоновкиДанных.Равно,, ВыводитьСчета = 1);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаявкиДС_Список, "ТребуетЗаявкиНаРсходДСИЕстьЛимит",ВыводитьСчета = 2, ВидСравненияКомпоновкиДанных.Равно,, ВыводитьСчета = 2);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиДС_Создать_провести(Команда)
	
	КоличествоЭлементов = Элементы.ЗаявкиДС_Список.ВыделенныеСтроки.Количество();
	Если КоличествоЭлементов>0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаявкиДС_Создать_провестиПродолжение", ЭтотОбъект),
		"Вы действительно хотите обработать " + КоличествоЭлементов + " заявок?",
		РежимДиалогаВопрос.ДаНет);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиДС_Создать_провестиПродолжение2(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса<>КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;	
	
	//Создаем документ
	ЗаявкуДС_Создать_провести_Сервер(ДополнительныеПараметры);
	Элементы.ЗаявкиДС_Список.Обновить();	
КонецПроцедуры


&НаКлиенте
Процедура ЗаявкиДС_Создать_провестиПродолжение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса<>КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;	
	
	
	//**Было, но нужно задавать вопрос по каждой заявке ЗаявкиДС_Создать_провести_Сервер(Элементы.ЗаявкиДС_Список.ВыделенныеСтроки);
	Для Каждого лСтрока Из Элементы.ЗаявкиДС_Список.ВыделенныеСтроки Цикл 
		лОтвет =ПроверитьНаСоответствиеЛимитов(лСтрока);
		Если НЕ лОтвет.Результат Тогда
			Если лОтвет.МожноПревышатьЛимит Тогда
				//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				//лОтвет.ТекстОшибки,
				//лСтрока);
				//Задаем вопрос, создавать ли заявку при превышении
				ПоказатьВопрос(Новый ОписаниеОповещения("ЗаявкиДС_Создать_провестиПродолжение2",ЭтотОбъект, Новый Структура("лСтрока,лОтвет",лСтрока,лОтвет)),
				""+лСтрока+Символы.ПС+	лОтвет.ТекстОшибки + Символы.ПС+"Провести заявку сверх лимита? ",
				РежимДиалогаВопрос.ДаНет);
				
			Иначе	
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				лОтвет.ТекстОшибки,
				лСтрока);
				Продолжить;
			КонецЕсли;
		Иначе
			//Создаем документ
			ЗаявкуДС_Создать_провести_Сервер(лСтрока);
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ЗаявкиДС_Список.Обновить();
	
КонецПроцедуры



&НаСервере
Процедура ЗаявкиДС_Создать_провести_Сервер(Знач пВыделенныеСтроки)
	
	Для Каждого лСтрока Из пВыделенныеСтроки Цикл 
		лДок = Документы.ЗаявкаНаРасходованиеДенежныхСредств.СоздатьДокумент();
		лДок.Заполнить( лСтрока ); 
		лДок.Дата	= ТекущаяДата();
		
		лОтвет = лДок.ПроверитьНаСоответствиеЛимитов();
		Если НЕ лОтвет.Результат Тогда
			Если лОтвет.МожноПревышатьЛимит Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				лОтвет.ТекстОшибки,
				лСтрока);
			Иначе	
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				лОтвет.ТекстОшибки,
				лСтрока);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		
		Если лДок.СуммаДокумента = 0 Тогда 
			//Сава: 2016/08
			Продолжить;
		КонецЕсли;
		
		Попытка 
			лДок.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Ошибка при проведении заявки: " + ОписаниеОшибки(),
			лСтрока);
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ЗаявкуДС_Создать_провести_Сервер(Знач лСтрока)
	лДок = Документы.ЗаявкаНаРасходованиеДенежныхСредств.СоздатьДокумент();
	Если ТипЗнч(лСтрока)= Тип("Структура") Тогда
		лДок.Заполнить(лСтрока.лСтрока); 	
		лДок.ПревышениеБюджета=Истина;
		лДок.СуммаПревышенияБюджета=лСтрока.лОтвет.СуммаПревышения;
	Иначе
		лДок.Заполнить( лСтрока ); 	
	КонецЕсли;
	
	
	
	лДок.Дата	= ТекущаяДата();
	
	//лОтвет = лДок.ПроверитьНаСоответствиеЛимитов();
	//Если НЕ лОтвет.Результат Тогда
	//	Если лОтвет.МожноПревышатьЛимит Тогда
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
	//		лОтвет.ТекстОшибки,
	//		лСтрока);
	//	Иначе	
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
	//		лОтвет.ТекстОшибки,
	//		лСтрока);
	//		Продолжить;
	//	КонецЕсли;
	//КонецЕсли;
	
	
	Если лДок.СуммаДокумента = 0 Тогда 
		//Сава: 2016/08
		Возврат;
	КонецЕсли;
	
	Попытка 
		лДок.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		"Ошибка при проведении заявки: " + ОписаниеОшибки(),
		лСтрока);
	КонецПопытки;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Виза_НаВизуМнеПриИзменении(Элемент)
	УстановитьПараметрыСписка1();
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыСписка1()
	
	Виза_Список.Параметры.УстановитьЗначениеПараметра("МнеНаВизиврование", 		Виза_НаВизуМне  );
	Виза_Список.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", 	Пользователи.ТекущийПользователь() );
	Виза_Список.Параметры.УстановитьЗначениеПараметра("Состояние_НаУтверждение",Перечисления.Визы_Состояния.НаВизировании);
	Виза_Список.Параметры.УстановитьЗначениеПараметра("НеПоказыватьОплаченные" ,НеПоказыватьОплаченные);
	Виза_Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьПомеченныеНаУдаление" ,ПоказыватьПомеченныеНаУдаление);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПрисоединенныеФайлы(Команда)
	
	ПараметрыФормы = Новый Структура;
	//**ПараметрыФормы.Вставить("ВладелецФайла", Элементы.Виза_Список.ТекущиеДанные.Ссылка);
	ПараметрыФормы.Вставить("ВладелецФайла", Элементы.Виза_Список.ТекущаяСтрока);
	ОткрытьФорму("Справочник.Файлы.Форма.ФормаСпискаПрисоединенныхФайлов", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Виза_СписокПриАктивизацииСтроки(Элемент)
	
	Выделено_Виза = ПолучитьСуммуКолонок(Элемент, Новый Структура("СуммаДокумента, БН, Нал") );
	Выделено_Виза = ?(ПустаяСтрока(Выделено_Виза), "", "Всего выбрано: " + Выделено_Виза);
	
КонецПроцедуры


&НаКлиенте
Функция ПолучитьСуммуКолонок(пЭлемент, пСуммы)
	
	Для Каждого лПара Из пСуммы Цикл
		пСуммы[лПара.Ключ] = 0;
	КонецЦикла;
	
	Для Каждого лСтрока Из пЭлемент.ВыделенныеСтроки Цикл
		лВремПерем = пЭлемент.ДанныеСтроки(лСтрока);
		Для Каждого лПара Из пСуммы Цикл 
			Попытка
				пСуммы[лПара.Ключ] = пСуммы[лПара.Ключ] + лВремПерем[лПара.Ключ];
			Исключение
				
			КонецПопытки;
		КонецЦикла;
	КонецЦикла;
	
	лВремПерем = "";
	Для Каждого лПара Из пСуммы Цикл
		//Если лПара.Значение = 0 тогда 
		//	Продолжить;
		//КонецЕсли;
		лИмя = Элементы.Найти(лПара.Ключ);
		лИмя = ?(лИмя = Неопределено ИЛИ ПустаяСтрока(лИмя.Заголовок) , лПара.Ключ, лИмя.Заголовок);
		лВремПерем = лВремПерем +  "; " +лИмя + ": " + Формат(лПара.Значение, "ЧДЦ=2; ЧРГ=") ;
	КонецЦикла;
	
	Возврат Сред( лВремПерем, 2 ); 
	
КонецФункции


&НаКлиенте
Процедура ЗаявкиДС_СписокПриАктивизацииСтроки(Элемент)
	
	Выделено_ЗаявкиДС = ПолучитьСуммуКолонок( Элемент, Новый Структура("КОплате, Нал, БН") );
	
	Выделено_ЗаявкиДС = ?(ПустаяСтрока(Выделено_ЗаявкиДС), "", "Всего на заяки: " + Выделено_ЗаявкиДС);
	
КонецПроцедуры

&НаКлиенте
Процедура НеПоказыватьОплаченныеПриИзменении(Элемент)
	
	УстановитьПараметрыСписка1();
	
	НеПоказыватьОплаченныеПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура НеПоказыватьОплаченныеПриИзмененииНаСервере()
	
	ХранилищеОбщихНастроек.Сохранить("ФормаСпискаВизирования","НеПоказыватьОплаченные", НеПоказыватьОплаченные,, ПользователиИнформационнойБазы.ТекущийПользователь());
	
КонецПроцедуры

&НаКлиенте
Процедура Виза_КонтрагентПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Виза_Список, "Контрагент", Виза_Контрагент, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Виза_Контрагент));
	
КонецПроцедуры

&НаСервере
Процедура ИтогПоСчетамНаСервере()
	
	СхемаКомпоновкиДанных = Элементы.Виза_Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	НастройкиКомпоновкиДанных = Элементы.Виза_Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ИтоговаяСуммаДокумента = ТаблицаЗначений.Итог("СуммаДокумента");	
	ИтоговаяНал = ТаблицаЗначений.Итог("Нал");	
	ИтоговаяБН = ТаблицаЗначений.Итог("БН");	
	
	Выделено_Виза = "Сумма: " + ИтоговаяСуммаДокумента + " ; Б/Н : " + ИтоговаяБН + " Ф2: " + ИтоговаяНал;
	
	Выделено_Виза = ?(ПустаяСтрока(Выделено_Виза), "", "Всего выбрано: " + Выделено_Виза);
	
	Для Каждого Строка из ТаблицаЗначений Цикл
		Элементы.Виза_Список.ВыделенныеСтроки.Добавить(Строка.Ссылка);
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ИтогПоСчетам(Команда)
	
	ИтогПоСчетамНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьПомеченныеНаУдаление(Команда)
	
	ПоказыватьПомеченныеНаУдаление = Не ПоказыватьПомеченныеНаУдаление;
	Элементы.СписокКонтекстноеМенюПоказыватьПомеченныеНаУдаление.Пометка = ПоказыватьПомеченныеНаУдаление;
	УстановитьПараметрыСписка1();
	Элементы.Виза_Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ВсеСчетаБезналаПриИзменении(Элемент)
	ВсеСчетаБезналаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВсеСчетаБезналаПриИзмененииНаСервере()
	Если ВсеСчетаБезнала=0 Тогда
		СписокТребующиеБезнала.Параметры.УстановитьЗначениеПараметра("ВсеСчета", Истина);
	Иначе
		СписокТребующиеБезнала.Параметры.УстановитьЗначениеПараметра("ВсеСчета", Ложь);
	КонецЕсли;
	Элементы.СписокТребующиеБезнала.Обновить();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИтоговуюСумму(Массив, ИмяРеквизита)
	Результат = 0;
	Для Каждого Строка Из Массив Цикл
		Результат = Результат + Строка[ИмяРеквизита];
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаСервереБезКонтекста
Процедура СоздатьСчетаНеИнтерактивно(ДополнительныеПараметры)
	
	НовыйДокумент = Документы.СчетНаОплатуПоставщика.СоздатьДокумент();
	НовыйДокумент.Дата = ТекущаяДата();
	НовыйДокумент.Заполнить(ДополнительныеПараметры.ЗначенияЗаполнения);
	НовыйДокумент.УстановитьНовыйНомер();
	
	Попытка
		НовыйДокумент.Записать();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Создан " + НовыйДокумент.Ссылка;
		Сообщение.Сообщить();
	Исключение
		Инфо = ИнформацияОбОшибке();
		Сообщение = Новый СообщениеПользователю;
		Если ЗначениеЗаполнено(Инфо.Причина<>Неопределено) Тогда
			Сообщение.Текст = Инфо.Причина.Описание;
		Иначе
			Сообщение.Текст = Инфо.Описание;
		КонецЕсли; 
		Сообщение.Сообщить();		
	КонецПопытки
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьЗаявкаНаРасходованиеДС(Счет)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗаявкаНаРасходованиеДенежныхСредств.Ссылка
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
	|ГДЕ
	|	ЗаявкаНаРасходованиеДенежныхСредств.СчетНаОплатуПоставщика = &СчетНаОплатуПоставщика
	|	И ЗаявкаНаРасходованиеДенежныхСредств.Проведен"
	);
	Запрос.УстановитьПараметр("СчетНаОплатуПоставщика", Счет);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	КонецЕсли; 
	
	Возврат Ложь;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ДополнитьСтруктуруНаСервере(ЗначенияЗаполнения, МассивКопия, ИмяКонстанты, ИмяКолонкиСумма)
	
	Массив = Новый Массив;
	Для Каждого Строка Из МассивКопия Цикл
		//++ Павел Чистяков 13.10.2016 19:26:58 №328
		Если Не ЕстьЗаявкаНаРасходованиеДС(Строка) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.КлючДанных = Строка;
			Сообщение.Текст = "Под счет " + Строка + " не создана Заявка на оплату";
			Сообщение.Сообщить();
			Продолжить;
		КонецЕсли;
		Массив.Добавить(Строка);
	КонецЦикла;
	
	ЗначенияЗаполнения.Вставить("СчетаОснования", Массив);
	
	Если Массив.Количество()=0 Тогда
		Возврат;
	КонецЕсли; 
	
	Счет = Массив[0];
	ЗначенияЗаполнения.Вставить("ПлановаяДатаОплаты", ТекущаяДата());
	ЗначенияЗаполнения.Вставить("Подразделение", Счет.Подразделение);
	ЗначенияЗаполнения.Вставить("Организация", Счет.Организация);
	ЗначенияЗаполнения.Вставить("Контрагент", Счет.Контрагент);
	ЗначенияЗаполнения.Вставить("СчетКонтрагента", Счет.СчетКонтрагента);
	ЗначенияЗаполнения.Вставить("ВалютаДокумента", Счет.ВалютаДокумента);
	ЗначенияЗаполнения.Вставить("Ответственный", ПараметрыСеанса.ТекущийПользователь);
	ЗначенияЗаполнения.Вставить("Автор", ПараметрыСеанса.ТекущийПользователь);
	ЗначенияЗаполнения.Вставить("ВидОплаты", Перечисления.ВидыДенежныхСредств.Безналичные);
	ЗначенияЗаполнения.Вставить("СтатьяДвиженияДенежныхСредств", Константы[ИмяКонстанты].Получить());
	ЗначенияЗаполнения.Вставить("СуммаДокумента", ПолучитьИтоговуюСумму(Массив, ИмяКолонкиСумма));
	ЗначенияЗаполнения.Вставить("НазначениеПлатежа", Счет.НазначениеПлатежа);
	ЗначенияЗаполнения.Вставить("НомерВходящегоДокумента", Счет.Номер);
	ЗначенияЗаполнения.Вставить("ДатаВходящегоДокумента", Счет.Дата);
	ЗначенияЗаполнения.Вставить("ВидОперации", Перечисления.ВидыОперацийСчетНаОплатуПоставщику.Транзит);
	ЗначенияЗаполнения.Вставить("Виза_Состояние", Перечисления.Визы_Состояния.Черновик);
	ЗначенияЗаполнения.Вставить("Секция", Счет.Секция);
	ЗначенияЗаполнения.Вставить("Этаж", Счет.Этаж);
	
	Визы = Новый Массив;
	Визы.Добавить(ПараметрыСеанса.ТекущийПользователь);
	ЗначенияЗаполнения.Вставить("Визы", Визы);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСчета(Команда)
	
	Массив = Новый Массив;
	Для Каждого Строка Из Элементы.СписокТребующиеБезнала.ВыделенныеСтроки Цикл
		Массив.Добавить(Строка);
	КонецЦикла; 
	
	Если Массив.Количество()=0 Тогда
		Сообщить = Новый СообщениеПользователю;
		Сообщить.Текст = "Не выбрано ни одного счета.";
		Сообщить.Сообщить();
		Возврат;
	КонецЕсли; 
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Комментарий", "Транзит наличных средств");
	ДополнитьСтруктуруНаСервере(ЗначенияЗаполнения, Массив, "СтатьяТранзитНал", "СуммаДокумента");
	ЗначенияЗаполнения.Вставить("ПлановаяДатаОплаты", ТекущаяДата());
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	Если ЗначенияЗаполнения.СчетаОснования.Количество()>0 Тогда
		ОткрытьФорму("Документ.СчетНаОплатуПоставщика.ФормаОбъекта", ДополнительныеПараметры, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли; 
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Комментарий", "Коммисия за транзит наличных средств");
	ДополнитьСтруктуруНаСервере(ЗначенияЗаполнения, Массив, "СтатьяКомисияНал", "СуммаКоммисии");
	ЗначенияЗаполнения.Вставить("ПлановаяДатаОплаты", ТекущаяДата());
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	Если ЗначенияЗаполнения.СчетаОснования.Количество()>0 Тогда
		ОткрытьФорму("Документ.СчетНаОплатуПоставщика.ФормаОбъекта", ДополнительныеПараметры, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОплатыПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаявкиДС_Список, "ВидОплаты", ВидОплаты, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ВидОплаты));
КонецПроцедуры



&НаСервере
Функция ПроверитьНаСоответствиеЛимитов(ТекСчет)Экспорт
	
	СтруктураОтвета = Новый Структура("Результат,ТекстОшибки,МожноПревышатьЛимит,СуммаПревышения",Ложь,"",Ложь,0);
	//СтруктураОтвета = Новый Структура("Результат,ТекстОшибки",Истина,"");
	//Возврат СтруктураОтвета ; 
	
	СтруктураОтвета.МожноПревышатьЛимит=РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ПолныеПрава");
	
	Дата= ТекущаяДата();
	
	Запрос = Новый Запрос;
	Запрос.Текст=  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЕСТЬNULL(БюджетыНаМесяцОбороты.СуммаОборот, 0) КАК СуммаОборот
	               |ИЗ
	               |	РегистрНакопления.БюджетыНаМесяц.Обороты(
	               |			&НачДата,
	               |			&КонДата,
	               |			,
	               |			Подразделение = &Подразделение
	               |				И ВидПериода = &ВидПериодаНеделя) КАК БюджетыНаМесяцОбороты";
	ЗАпрос.УстановитьПараметр("НачДата",				НачалоНедели(Дата));
	ЗАпрос.УстановитьПараметр("КонДата",				КонецДня(КонецНедели(Дата)));
	
	ЗАпрос.УстановитьПараметр("Подразделение",			ТекСчет.Подразделение);
	ЗАпрос.УстановитьПараметр("ВидПериодаНеделя",				Перечисления.ВидыПериодовБюджетирования.Неделя);
	Выборка = Запрос.Выполнить().Выбрать();
	
	//По умолчанию = месяц
	ВидПериода=Перечисления.ВидыПериодовБюджетирования.Месяц;
	
	Если Выборка.Следующий() Тогда
		Если Выборка.СуммаОборот<>0 Тогда
		   ВидПериода=Перечисления.ВидыПериодовБюджетирования.Неделя;
		КонецЕсли;
	КонецЕсли;
	
	
	//Запрос = Новый Запрос;
	Запрос.Текст=  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СУММА(БюджетыНаМесяцОбороты.СуммаОборот) КАК СуммаОборот
	               |ПОМЕСТИТЬ Запланировано
	               |ИЗ
	               |	РегистрНакопления.БюджетыНаМесяц.Обороты(
	               |			&НачДата,
	               |			&КонДата,
	               |			,
	               |			Подразделение = &Подразделение
	               |				И ПоказательБюджета = &СтатьяДвиженияДенежныхСредств
	               |				И ВидПериода = &ВидПериода
	               |				И ВидОплаты = &ВидОплаты) КАК БюджетыНаМесяцОбороты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(БДДСОбороты.СуммаОборот) КАК СуммаОборот
	               |ПОМЕСТИТЬ Потрачено
	               |ИЗ
	               |	РегистрНакопления.БДДС.Обороты(
	               |			&НачДата,
	               |			&КонДата,
	               |			,
	               |			Подразделение = &Подразделение
	               |				И ВидОплаты = &ВидОплаты
	               |				И СтатьяДвиженияДенежныхСредств = &СтатьяДвиженияДенежныхСредств) КАК БДДСОбороты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(Запланировано.СуммаОборот, 0) - ЕСТЬNULL(Потрачено.СуммаОборот, 0) КАК СуммаОстаток
	               |ИЗ
	               |	Запланировано КАК Запланировано
	               |		ПОЛНОЕ СОЕДИНЕНИЕ Потрачено КАК Потрачено
	               |		ПО (ИСТИНА)";
	
	
	
	Если    ВидПериода=Перечисления.ВидыПериодовБюджетирования.Неделя Тогда
		
	ИНаче	
		ЗАпрос.УстановитьПараметр("НачДата",				НачалоМесяца(Дата));
		ЗАпрос.УстановитьПараметр("КонДата",				КонецМесяца(Дата));
	КонецЕсли;
	
	ЗАпрос.УстановитьПараметр("Организация",			ТекСчет.Организация);
	ЗАпрос.УстановитьПараметр("Подразделение",			ТекСчет.Подразделение);
	ЗАпрос.УстановитьПараметр("ВидОплаты",				ТекСчет.ВидОплаты);
	ЗАпрос.УстановитьПараметр("ВидПериода",				ВидПериода);
	ЗАпрос.УстановитьПараметр("СтатьяДвиженияДенежныхСредств",ТекСчет.СтатьяДвиженияДенежныхСредств);
	
	Выборка = запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если Выборка.СуммаОстаток >=ТекСчет.СуммаДокумента Тогда
			СтруктураОтвета.Результат=Истина;
		Иначе	
			СтруктураОтвета.СуммаПревышения=  (-Выборка.СуммаОстаток+ТекСчет.СуммаДокумента);
			СтруктураОтвета.ТекстОшибки="Проверка бюджета. Подразделение= "+ТекСчет.Подразделение+", Статья = "+ТекСчет.СтатьяДвиженияДенежныхСредств+ " Превышен лимит расхода на "+(-Выборка.СуммаОстаток+ТекСчет.СуммаДокумента);
			
		КонецЕсли;
	Иначе
		СтруктураОтвета.СуммаПревышения=  (ТекСчет.СуммаДокумента);
		СтруктураОтвета.ТекстОшибки="Проверка бюджета. Подразделение= "+ТекСчет.Подразделение+", Статья = "+ТекСчет.СтатьяДвиженияДенежныхСредств+" Превышен лимит расхода на "+(ТекСчет.СуммаДокумента);
	КонецЕсли;
	
	////Сава: 2016/05 - на перспективу, если нет счета
	//Если ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда 
	//	Если Выборка.Следующий() Тогда
	//		Если 	Выборка.Лимит_СуммаОстаток>=СуммаДокумента 
	//			И	Выборка.Счет_СуммаОстаток >=СуммаДокумента	Тогда
	//			СтруктураОтвета.Результат=Истина;
	//		 Иначе
	//		 	СтруктураОтвета.ТекстОшибки=
	//				?(Выборка.Лимит_СуммаОстаток>=СуммаДокумента, "",  " Превышен лимит расхода на "+(-Выборка.Лимит_СуммаОстаток+СуммаДокумента))
	//			   +?(Выборка.Счет_СуммаОстаток >=СуммаДокумента, "",  ", Превышена сумма по счету на "+(-Выборка.Счет_СуммаОстаток+СуммаДокумента)); 
	//			СтруктураОтвета.ТекстОшибки = СокрЛП(Сред(СтруктураОтвета.ТекстОшибки, 2) );
	//		 КонецЕсли;
	//	Иначе	
	//		 СтруктураОтвета.ТекстОшибки="Превышен лимит расхода и сумма по счету на "+СуммаДокумента ;
	//	 КонецЕсли;
	//Иначе 
	//	Если Выборка.Следующий() Тогда
	//		Если 	Выборка.Лимит_СуммаОстаток>=СуммаДокумента Тогда
	//			СтруктураОтвета.Результат=Истина;
	//		 Иначе
	//		 	СтруктураОтвета.ТекстОшибки=
	//				?(Выборка.Лимит_СуммаОстаток>=СуммаДокумента, "",  " Превышен лимит расхода на "+(-Выборка.Лимит_СуммаОстаток+СуммаДокумента));
	//		 КонецЕсли;
	//	Иначе	
	//		 СтруктураОтвета.ТекстОшибки="Превышен лимит расхода на "+СуммаДокумента ;
	//	КонецЕсли;	 
	//КонецЕсли;
	
	Возврат СтруктураОтвета;
	
КонецФункции


&НаКлиенте
Процедура Виза_СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле = Элементы.ННЗарегистрирована Тогда
		Если ЕстьПраваНаУстановкуОтметки() Тогда 
			
			СтандартнаяОбработка = Ложь;
			Если ЗаписьСуществует(ВыбраннаяСтрока) Тогда
				ПередаваемыеПараметры= Новый Структура("ДокументОснование",ВыбраннаяСтрока);   
				ПараметрыМассив = Новый Массив;
				ПараметрыМассив.Добавить(ПередаваемыеПараметры); 
				
				КлючЗаписиРегистра = Новый("РегистрСведенийКлючЗаписи.ОтметкиРегистрацииНН", ПараметрыМассив); 
				ОткрытьФорму("РегистрСведений.ОтметкиРегистрацииНН.ФормаЗаписи", Новый Структура("Ключ", КлючЗаписиРегистра), ЭтаФорма,,ВариантОткрытияОкна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			Иначе
				ОткрытьФорму("РегистрСведений.ОтметкиРегистрацииНН.ФормаЗаписи", Новый Структура("ЗначенияЗаполнения", Новый Структура("ДокументОснование",ВыбраннаяСтрока)), ЭтаФорма,,ВариантОткрытияОкна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			КонецЕсли;
			
			
			
			//ПараметрыФормы = Новый Структура("ДокументОснование",ВыбраннаяСтрока);
			//ОткрытьФорму("РегистрСведений.ОтметкиРегистрацииНН.ФормаЗаписи", ПараметрыФормы,ЭтаФорма,,ВариантОткрытияОкна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
			//УстановитьОтметкуПолученияНН(ВыбраннаяСтрока);
			//ПараметрыФормы = Новый Структура("Отбор",Новый Структура("ВладелецФайла",ВыбраннаяСтрока));
			//ОткрытьФорму("Справочник.Файлы.ФормаСписка", ПараметрыФормы, ЭтаФорма,,ВариантОткрытияОкна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

Функция ЕстьПраваНаУстановкуОтметки() 
      Возврат РольДоступна("УстановкаОтметкиРегистрацииНН");	
КонецФункции // ()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия="ОбновилиОтметкиРегистрацииНН" Тогда
		//ЭтаФорма.ОбновитьОтображениеДанных(
		Элементы.Виза_Список.Обновить();
	КонецЕсли;
КонецПроцедуры

   Функция ЗаписьСуществует(ВыбраннаяСтрока)
      Запрос = новый Запрос;
	  Запрос.Текст=  "ВЫБРАТЬ
	                |	ОтправкаПолучениеДокументов.ДокументОснование
	                |ИЗ
	                |	РегистрСведений.ОтметкиРегистрацииНН КАК ОтправкаПолучениеДокументов
	                |ГДЕ
	                |	ОтправкаПолучениеДокументов.ДокументОснование = &ДокументОснование";
	  ЗАпрос.УстановитьПараметр("ДокументОснование",ВыбраннаяСтрока);
	  Возврат НЕ Запрос.Выполнить().Пустой();
КонецФункции // (
